In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('marketing_campaign.csv', sep='\t')

In [3]:
df.head()

     ID  Year_Birth   Education  ... Z_CostContact  Z_Revenue  Response
0  5524        1957  Graduation  ...             3         11         1
1  2174        1954  Graduation  ...             3         11         0
2  4141        1965  Graduation  ...             3         11         0
3  6182        1984  Graduation  ...             3         11         0
4  5324        1981         PhD  ...             3         11         0

[5 rows x 29 columns]

In [4]:
df.shape

(2240, 29)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

Cosas que pueden observarse en info():

1.   Existen valores nulos en "Income"
2.   La fecha **Dt_customer** de cuando se metio al cliente en el Dataset no esta parseada

En primer lugar, vamos a proceder a eliminar los datos con valores a null en el campo "Income". El hecho de que no los sustituya por el valor medio del campo se debe a que un valor medio no sería un valor "real" para este dataset.

In [6]:
df = df.dropna()
df.shape

(2216, 29)

En segundo lugar creamos la columna **Customer_For** que indican los dias que lleva el cliente registrado en la base de datos.

In [7]:
df['Dt_Customer'] = pd.to_datetime(df['Dt_Customer'])
most_recent_date = df['Dt_Customer'].max()
df['Customer_For'] = df.apply(lambda x: (most_recent_date - x['Dt_Customer']).days, axis=1)
df["Customer_For"] = pd.to_numeric(df["Customer_For"], errors="coerce")

Una vez termiando los cambios anterior, el siguiente paso será extraer nuevos atributos a partir de los atributos que existen ya en el Dataset. Las características que vamos a extraer son:

*   Edad del cliente a partir de su año de nacimiento
*   La cantidad que ha gastado el cliente en los diferentes productos
*   Crear un atributo numérico de 0/1 que indique si el cliente vive con alguna pareja
*   Crear un atributo que indique el número de hij@s que tenga el cliente
*   Indicar el tamaño de la unidad familiar del cliente
*   Simplificar los estudios del cliente
*   Eliminar atributos redundantes

In [8]:
# Edad del cliente
df['Age'] = 2021 - df['Year_Birth']

# Gasto total del cliente
df['Spent'] = df['MntWines'] + df['MntFruits'] + df['MntMeatProducts'] + df['MntFishProducts'] + df['MntSweetProducts'] + df['MntGoldProds']

# Vive con una pareja
df['Couple'] = df.apply(lambda x: 1 if (x['Marital_Status'] == 'Married' or
                                        x['Marital_Status'] == 'Together') 
                                        else 0, axis=1)

# Numero de hijos que tenga el cliente
df['Childrens'] = df['Kidhome'] + df['Teenhome']

# Tamaño de la unidad familiar
df['Family_Size'] = df['Couple'] + 1 + df['Childrens']

# Simplificamos la informacion de los estudios
df["Education"] = df["Education"].replace({"Basic":"Undergraduate",
                                             "2n Cycle":"Undergraduate", 
                                             "Graduation":"Graduate", 
                                             "Master":"Postgraduate", 
                                             "PhD":"Postgraduate"})

# Eliminamos atributos que nos son relevantes
to_delete = ['Year_Birth', 'Dt_Customer', 'Marital_Status', 'Z_CostContact',
             'Z_Revenue', 'ID']
df = df.drop(columns=to_delete)

      Education   Income  Kidhome  ...  Couple  Childrens  Family_Size
0      Graduate  58138.0        0  ...       0          0            1
1      Graduate  46344.0        1  ...       0          2            3
2      Graduate  71613.0        0  ...       1          0            2
3      Graduate  26646.0        1  ...       1          1            3
4  Postgraduate  58293.0        1  ...       1          1            3

[5 rows x 29 columns]

Una vez calculado los nuevos atributos vamos a ver las estadisticas del dataset

In [9]:
df.describe()

              Income      Kidhome  ...    Childrens  Family_Size
count    2216.000000  2216.000000  ...  2216.000000  2216.000000
mean    52247.251354     0.441787  ...     0.947202     2.592509
std     25173.076661     0.536896  ...     0.749062     0.905722
min      1730.000000     0.000000  ...     0.000000     1.000000
25%     35303.000000     0.000000  ...     0.000000     2.000000
50%     51381.500000     0.000000  ...     1.000000     3.000000
75%     68522.000000     1.000000  ...     1.000000     3.000000
max    666666.000000     2.000000  ...     3.000000     5.000000

[8 rows x 28 columns]